tutorials/mesh/parallel/filter/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // filter
    {
        name    filterCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (1.5 -10 -10) (2 10 10);
        }
    }
    {
        name    filter;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set filterCells;
        }
    }


    {
        name    leftFluidCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-10 -10 -10) (1.5 10 10);
        }
    }
    {
        name    leftFluid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set leftFluidCells;
        }
    }
    {
        name    rightFluidCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (2 -1 -1) (10 10 10);
        }
    }
    {
        name    rightFluid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set rightFluidCells;
        }
    }


    // cycLeft
    {
        name    cycLeftFaces;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
            set     filterCells;
            option  all;
        }
    }
    {
        name    cycLeftFaces;
        type    faceSet;
        action  subset;
        source  cellToFace;
        sourceInfo
        {
            set     leftFluidCells;
            option  all;
        }
    }
    // Create faceZone from cycLeft
    {
        name    cycLeft;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet cycLeftFaces;    // name of faceSet
        }
    }

    // cycRight
    {
        name    cycRightFaces;
        type    faceSet;
        action  new;
        source  cellToFace;
        sourceInfo
        {
            set     filterCells;
            option  all;
        }
    }
    {
        name    cycRightFaces;
        type    faceSet;
        action  subset;
        source  cellToFace;
        sourceInfo
        {
            set     rightFluidCells;
            option  all;
        }
    }
    // Create faceZone from cycRight
    {
        name    cycRight;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet cycRightFaces;   // name of faceSet
        }
    }

);

// ************************************************************************* //
